module.exports = [{
    "name": "Познавателни процеси в математиката",
    "group": "Други",
    "teacher": "доц. Т. Тонова",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 14,
    "to": 18,
    "room": "ФМИ-302"
}, {
    "name": "Съвременна физика",
    "group": "Други",
    "teacher": "проф. С. Иванов",
    "type": "лек+сем",
    "day": "Вторник",
    "from": 18,
    "to": 20,
    "room": "ФМИ-514"
}, {
    "name": "Съвременна физика",
    "group": "Други",
    "teacher": "проф. С. Иванов",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 18,
    "to": 20,
    "room": "ФМИ-514"
}, {
    "name": "Устройство на компютърните системи",
    "group": "Други",
    "teacher": "гл.ас.Ю. Цурковски",
    "type": "лек+лаб",
    "day": "Понеделник",
    "from": 17,
    "to": 19,
    "room": ""
}, {
    "name": "Философия и логика",
    "group": "Други",
    "teacher": "доц. Вл. Сотиров",
    "type": "лек",
    "day": "Четвъртък",
    "from": 16,
    "to": 18,
    "room": ""
}, {
    "name": "Биостатистика",
    "group": "Статистика",
    "teacher": "доц. д-р Р. Георгиева",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 11,
    "room": "ФМИ-120к"
}, {
    "name": "Биостатистика",
    "group": "Статистика",
    "teacher": "ас. Д. Григорова",
    "type": "лаб",
    "day": "Вторник",
    "from": 11,
    "to": 13,
    "room": "ФМИ-120к"
}, {
    "name": "Модели в социалните науки",
    "group": "Статистика",
    "teacher": "доц. В. Стоименова",
    "type": "лек+лаб",
    "day": "Понеделник",
    "from": 7,
    "to": 11,
    "room": "ФМИ-514"
}, {
    "name": "Модели на смъртност",
    "group": "Статистика",
    "teacher": "доц. В. Стоименова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 8,
    "to": 11,
    "room": "ФМИ-514"
}, {
    "name": "Статистически методи в БДС",
    "group": "Статистика",
    "teacher": "доц. Пл. Матеев",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 16,
    "to": 20,
    "room": "ФМИ-303"
}, {
    "name": "Факторни планове",
    "group": "Статистика",
    "teacher": "доц. В. Стоименова",
    "type": "лек+лаб",
    "day": "Сряда",
    "from": 8,
    "to": 11,
    "room": "ФМИ-514"
}, {
    "name": "ПРЕДПРИЕМАЧЕСТВО „Учебна компания” (програма на „Джуниър Ачийвмънт”)",
    "group": "Семинари",
    "teacher": "доц. П. Русков, ас. Г. Къдрев, М. Стойчева, И. Милошева",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 18,
    "to": 22,
    "room": "ФМИ-325"
}, {
    "name": "Семинар \"Динамични системи и теория на числата\" - 2 част",
    "group": "Семинари",
    "teacher": "проф. Е. Хорозов, доц. А.Живков",
    "type": "лек",
    "day": "Вторник",
    "from": 16,
    "to": 19,
    "room": "ФМИ-210"
}, {
    "name": "Семинар \"Допълнителни въпроси от ДИС\"",
    "group": "Семинари",
    "teacher": "доц. П. Първанов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 15,
    "to": 18,
    "room": "ФМИ-307"
}, {
    "name": "Семинар по алгоритми",
    "group": "Семинари",
    "teacher": "доц. М. Марков",
    "type": "лек",
    "day": "Сряда",
    "from": 16,
    "to": 19,
    "room": "ФМИ-308"
}, {
    "name": "Семинар по Диференциални уравнения",
    "group": "Семинари",
    "teacher": "доц. О. Христов",
    "type": "лек",
    "day": "Понеделник",
    "from": 16,
    "to": 19,
    "room": "ФМИ-404"
}, {
    "name": "Семинар по Проектиране и интегриране на софтуерни системи",
    "group": "Семинари",
    "teacher": "доц. д-р Десислава Петрова-Антонова, ас. Ирена Павлова",
    "type": "сем",
    "day": "Четвъртък",
    "from": 16,
    "to": 18,
    "room": "ФМИ-326"
}, {
    "name": "Семинар по функционален анализ",
    "group": "Семинари",
    "teacher": "проф. Р. Леви, гл.ас. Н. Буюклиев",
    "type": "лек",
    "day": "Четвъртък",
    "from": 16,
    "to": 19,
    "room": "ФМИ-311"
}, {
    "name": "Matlab и приложения в числените методи",
    "group": "Приложна математика",
    "teacher": "ас. А. Авджиева",
    "type": "лек+лаб",
    "day": "Вторник",
    "from": 9,
    "to": 13,
    "room": "ФМИ-321к"
}, {
    "name": "Алгоритмични основи на компютърната графика",
    "group": "Приложна математика",
    "teacher": "доц. Н. Найденов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 9,
    "to": 11,
    "room": "ФМИ-306к"
}, {
    "name": "Алгоритмични основи на компютърната графика",
    "group": "Приложна математика",
    "teacher": "гл.ас. С. Костадинова",
    "type": "лаб",
    "day": "Вторник група 1",
    "from": 11,
    "to": 13,
    "room": "ФМИ-122к"
}, {
    "name": "Алгоритмични основи на компютърната графика",
    "group": "Приложна математика",
    "teacher": "гл.ас. С. Костадинова",
    "type": "лаб",
    "day": "Вторник (група 2)",
    "from": 13,
    "to": 15,
    "room": "ФМИ-122к"
}, {
    "name": "Анализ на Клифорд за диференциални уравнения",
    "group": "Приложна математика",
    "teacher": "гл.ас. С. Георгиев",
    "type": "лек+сем",
    "day": "Понеделник",
    "from": 14,
    "to": 18,
    "room": "ФЗФ-А301"
}, {
    "name": "Биостатистика",
    "group": "Приложна математика",
    "teacher": "доц. Р. Георгиева",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 11,
    "room": "ФМИ-120к"
}, {
    "name": "Биостатистика",
    "group": "Приложна математика",
    "teacher": "ас. Д. Григорова",
    "type": "лаб",
    "day": "Вторник",
    "from": 11,
    "to": 13,
    "room": "ФМИ-120к"
}, {
    "name": "Геометрия на движението",
    "group": "Приложна математика",
    "teacher": "проф. Г. Бояджиев, доц. П. Бойчев",
    "type": "лек+лаб",
    "day": "Сряда",
    "from": 9,
    "to": 12,
    "room": "ФМИ-326"
}, {
    "name": "Динамични системи",
    "group": "Приложна математика",
    "teacher": "доц. О. Христов",
    "type": "лек",
    "day": "Понеделник",
    "from": 13,
    "to": 16,
    "room": "ФХФ-604"
}, {
    "name": "Експериментални методи в механиката с практикум II",
    "group": "Приложна математика",
    "teacher": "доц. Т. Парталин",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 12,
    "room": "ФХФ-604"
}, {
    "name": "Избрани теми от биоматематиката",
    "group": "Приложна математика",
    "teacher": "доц. Т. Боев",
    "type": "лек",
    "day": "Сряда",
    "from": 16,
    "to": 18,
    "room": "ФМИ-311"
}, {
    "name": "Избрани теми от биоматематиката",
    "group": "Приложна математика",
    "teacher": "В. Дончев",
    "type": "сем+лаб",
    "day": "Вторник",
    "from": 17,
    "to": 19,
    "room": "ФМИ-309к"
}, {
    "name": "Математическа статистика",
    "group": "Приложна математика",
    "teacher": "доц. Д. Дончев",
    "type": "лек",
    "day": "Вторник",
    "from": 15,
    "to": 17,
    "room": "ФМИ-405"
}, {
    "name": "Математическа статистика",
    "group": "Приложна математика",
    "teacher": "гл.ас. Е. Иванова",
    "type": "сем",
    "day": "Сряда",
    "from": 13,
    "to": 15,
    "room": "ФМИ-305"
}, {
    "name": "Математически методи в метеорологията",
    "group": "Приложна математика",
    "teacher": "гл.ас. Р. Йорданов",
    "type": "лек",
    "day": "Сряда",
    "from": 16,
    "to": 19,
    "room": "ФМИ-401"
}, {
    "name": "Математически методи за обр. на сигнали - преобр.на Фурие и уейвлети",
    "group": "Приложна математика",
    "teacher": "проф. Р. Леви",
    "type": "лек",
    "day": "Понеделник",
    "from": 15,
    "to": 18,
    "room": "ФМИ-305"
}, {
    "name": "Математически модели и изчислителен експеримент",
    "group": "Приложна математика",
    "teacher": "проф. Ст. Димова, ас. Т. Иванов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 7,
    "to": 9,
    "room": "ФМИ-501"
}, {
    "name": "Математически модели и изчислителен експеримент",
    "group": "Приложна математика",
    "teacher": "проф. Ст. Димова, ас. Т. Иванов",
    "type": "лаб",
    "day": "Четвъртък",
    "from": 9,
    "to": 11,
    "room": "ФМИ-314к"
}, {
    "name": "Математически увод в икономиката",
    "group": "Приложна математика",
    "teacher": "доц. Й. Митев",
    "type": "лек",
    "day": "Понеделник",
    "from": 8,
    "to": 11,
    "room": "ФХФ-210"
}, {
    "name": "Математическо оптимиране",
    "group": "Приложна математика",
    "teacher": "проф. М. Кръстанов",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 11,
    "room": "ФМИ-311"
}, {
    "name": "Математическо оптимиране",
    "group": "Приложна математика",
    "teacher": "гл.ас. А. Попова",
    "type": "сем",
    "day": "Вторник",
    "from": 11,
    "to": 13,
    "room": "ФМИ-526"
}, {
    "name": "Методи за оптимизация",
    "group": "Приложна математика",
    "teacher": "проф. М. Кръстанов",
    "type": "лек",
    "day": "Сряда",
    "from": 15,
    "to": 18,
    "room": "ФМИ-303"
}, {
    "name": "Модели в социалните науки",
    "group": "Приложна математика",
    "teacher": "доц. В. Стоименова",
    "type": "лек+лаб",
    "day": "Понеделник",
    "from": 7,
    "to": 11,
    "room": "ФМИ-514"
}, {
    "name": "Модели на смъртност",
    "group": "Приложна математика",
    "teacher": "доц. В. Стоименова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 8,
    "to": 11,
    "room": "ФМИ-514"
}, {
    "name": "Паралелни алгоритми",
    "group": "Приложна математика",
    "teacher": "проф. С. Маргенов,\nгл.ас. Г. Бенчева",
    "type": "лек+сем+лаб",
    "day": "Петък",
    "from": 14,
    "to": 20,
    "room": "БАН, БЛ.25А"
}, {
    "name": "Приложения на математиката за моделиране на реални процеси",
    "group": "Приложна математика",
    "teacher": "проф. Ст. Димова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 18,
    "to": 21,
    "room": "ФМИ-320к"
}, {
    "name": "Приложения на математиката за моделиране на реални процеси",
    "group": "Приложна математика",
    "teacher": "проф. Ст. Димова",
    "type": "лаб",
    "day": "Вторник",
    "from": 17,
    "to": 20,
    "room": "ФМИ-314к"
}, {
    "name": "Случайни процеси",
    "group": "Приложна математика",
    "teacher": "доц. М. Божкова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 12,
    "to": 14,
    "room": "ФМИ-326"
}, {
    "name": "Случайни процеси",
    "group": "Приложна математика",
    "teacher": "М. Николова",
    "type": "сем",
    "day": "Четвъртък",
    "from": 14,
    "to": 16,
    "room": "ФМИ-303"
}, {
    "name": "Софтуер за научна визуализация",
    "group": "Приложна математика",
    "teacher": "гл.ас. Т. Попов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 17,
    "to": 19,
    "room": "ФМИ-Център"
}, {
    "name": "Статистически методи в актюерството",
    "group": "Приложна математика",
    "teacher": "доц. М. Божкова,\nгл.ас. Е. Каменов",
    "type": "лек",
    "day": "Понеделник",
    "from": 14,
    "to": 16,
    "room": "ФМИ-303"
}, {
    "name": "Статистически методи в актюерството",
    "group": "Приложна математика",
    "teacher": "доц. М. Божкова,\nгл.ас. Е. Каменов",
    "type": "сем",
    "day": "Понеделник",
    "from": 16,
    "to": 18,
    "room": "ФМИ-320к"
}, {
    "name": "Теория на нелинейните системи",
    "group": "Приложна математика",
    "teacher": "проф. М. Кръстанов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 12,
    "to": 15,
    "room": "ФМИ-305"
}, {
    "name": "Теория на солитоните",
    "group": "Приложна математика",
    "teacher": "гл.ас. Р. Йорданов",
    "type": "лек",
    "day": "Петък",
    "from": 9,
    "to": 12,
    "room": "ФМИ-302"
}, {
    "name": "Увод в статистиката",
    "group": "Приложна математика",
    "teacher": "доц. М. Божкова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 9,
    "to": 11,
    "room": "ФМИ-500"
}, {
    "name": "Увод в статистиката",
    "group": "Приложна математика",
    "teacher": "ас. Д. Григорова",
    "type": "сем",
    "day": "Четвъртък",
    "from": 11,
    "to": 13,
    "room": "ФМИ-514"
}, {
    "name": "Увод в теорията на динамичните системи и хаоса",
    "group": "Приложна математика",
    "teacher": "гл.ас. С. Георгиев",
    "type": "лек+сем",
    "day": "Вторник",
    "from": 14,
    "to": 18,
    "room": "ФЗФ-А301"
}, {
    "name": "Фрактали",
    "group": "Приложна математика",
    "teacher": "доц. М. Такев",
    "type": "лек",
    "day": "Вторник",
    "from": 17,
    "to": 20,
    "room": "ФХФ-601"
}, {
    "name": "Хидродинамика",
    "group": "Приложна математика",
    "teacher": "доц. Т. Парталин",
    "type": "лек",
    "day": "Четвъртък",
    "from": 9,
    "to": 12,
    "room": "ФХФ-603"
}, {
    "name": "Активна информационна сигурност 2",
    "group": "ОКН",
    "teacher": "д-р Г. Шарков",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 18,
    "to": 21,
    "room": "ФХФ-210"
}, {
    "name": "Векторна компютърна графика",
    "group": "ОКН",
    "teacher": "н.с. Б. Банчев",
    "type": "лек",
    "day": "Вторник",
    "from": 17,
    "to": 19,
    "room": "ФМИ-405"
}, {
    "name": "Векторна компютърна графика",
    "group": "ОКН",
    "teacher": "н.с. Б. Банчев",
    "type": "сем",
    "day": "Вторник",
    "from": 19,
    "to": 21,
    "room": "ФМИ-399к"
}, {
    "name": "Големи масиви от данни",
    "group": "ОКН",
    "teacher": "доц. А. Семерджиев, доц. К. Георгиев",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 16,
    "to": 20,
    "room": "ФМИ-01"
}, {
    "name": "Изчислимост в анализа",
    "group": "ОКН",
    "teacher": "проф. Д. Скордев",
    "type": "лек",
    "day": "Вторник",
    "from": 14,
    "to": 17,
    "room": "ФМИ-500"
}, {
    "name": "Комуникации в реално време. VoIP и видео разговори по Интернет",
    "group": "ОКН",
    "teacher": "д-р Емил Ивов",
    "type": "лек+сем",
    "day": "Вторник",
    "from": 18,
    "to": 21,
    "room": "ФМИ-229"
}, {
    "name": "Комуникации в реално време. VoIP и видео разговори по Интернет",
    "group": "ОКН",
    "teacher": "д-р Емил Ивов",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 18,
    "to": 21,
    "room": "ФМИ-229"
}, {
    "name": "Ламбда смятане и теория на доказателствата",
    "group": "ОКН",
    "teacher": "доц. Т. Трифонов",
    "type": "лек+сем",
    "day": "Понеделник",
    "from": 9,
    "to": 13,
    "room": "ФХФ-601"
}, {
    "name": "Мобилни приложения",
    "group": "ОКН",
    "teacher": "проф. В. Георгиев, Г.\nБайчев",
    "type": "лек+лаб",
    "day": "Сряда 1 гр.",
    "from": 17,
    "to": 21,
    "room": "ФМИ-107к"
}, {
    "name": "Мобилни приложения",
    "group": "ОКН",
    "teacher": "проф. В. Георгиев, Г.\nБайчев",
    "type": "лек+лаб",
    "day": "Сряда (2 гр.)",
    "from": 17,
    "to": 21,
    "room": "ФМИ-122к"
}, {
    "name": "Модели за управление на качеството 2",
    "group": "ОКН",
    "teacher": "д-р Г. Шарков, К. Караатанасов",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 18,
    "to": 21,
    "room": "ФМИ-326"
}, {
    "name": "Мрежова сигурност 2 - писане на сигурен код",
    "group": "ОКН",
    "teacher": "доц. Д. Биров,\nМ. Маринов",
    "type": "лек",
    "day": "Понеделник",
    "from": 19,
    "to": 21,
    "room": "ФМИ-326"
}, {
    "name": "Мрежова сигурност 2 - писане на сигурен код",
    "group": "ОКН",
    "teacher": "доц. Д. Биров,\nМ. Маринов",
    "type": "лек",
    "day": "Вторник",
    "from": 19,
    "to": 21,
    "room": "ФМИ-326"
}, {
    "name": "Приложения на крайните автомати",
    "group": "ОКН",
    "teacher": "доц. Ст. Михов",
    "type": "лек",
    "day": "Сряда",
    "from": 8,
    "to": 11,
    "room": "ФМИ-501"
}, {
    "name": "Приложения на крайните автомати",
    "group": "ОКН",
    "teacher": "С. Герджиков",
    "type": "сем",
    "day": "Сряда",
    "from": 11,
    "to": 13,
    "room": "ФМИ-501"
}, {
    "name": "Разширен семинар по програмиране",
    "group": "ОКН",
    "teacher": "доц. А. Семерджиев, доц. К. Георгиев",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 17,
    "to": 21,
    "room": "ФМИ-200"
}, {
    "name": "Семантика на езиците за програмиране",
    "group": "ОКН",
    "teacher": "доц. С. Николова",
    "type": "лек",
    "day": "Сряда",
    "from": 16,
    "to": 18,
    "room": "ФМИ-229"
}, {
    "name": "Семантика на езиците за програмиране",
    "group": "ОКН",
    "teacher": "С. Вътев",
    "type": "сем",
    "day": "Сряда",
    "from": 18,
    "to": 20,
    "room": "ФМИ-305"
}, {
    "name": "Структури от данни 2",
    "group": "ОКН",
    "teacher": "доц. А. Семерджиев",
    "type": "лек",
    "day": "Понеделник",
    "from": 18,
    "to": 21,
    "room": "ФХФ-210"
}, {
    "name": "Структури от данни 2",
    "group": "ОКН",
    "teacher": "гл.ас. П. Армянов",
    "type": "сем",
    "day": "Сряда",
    "from": 18,
    "to": 20,
    "room": "ФМИ-314к"
}, {
    "name": "Структури от данни 2",
    "group": "ОКН",
    "teacher": "гл.ас. П. Армянов",
    "type": "сем",
    "day": "Сряда",
    "from": 18,
    "to": 20,
    "room": "ФМИ-321к"
}, {
    "name": "Управление на знания",
    "group": "ОКН",
    "teacher": "доц. Е. Гурова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 16,
    "to": 18,
    "room": "ФМИ-101"
}, {
    "name": "Управление на знания",
    "group": "ОКН",
    "teacher": "доц. Е. Гурова",
    "type": "сем група 1",
    "day": "Четвъртък",
    "from": 18,
    "to": 20,
    "room": "ФМИ-101"
}, {
    "name": "Управление на знания",
    "group": "ОКН",
    "teacher": "Л. Зографова",
    "type": "сем група 2",
    "day": "Понеделник",
    "from": 18,
    "to": 20,
    "room": "ФМИ-01"
}, {
    "name": "Управление на знания",
    "group": "ОКН",
    "teacher": "М.Драгомирова",
    "type": "сем група 3",
    "day": "Сряда",
    "from": 19,
    "to": 21,
    "room": "ФМИ-500"
}, {
    "name": "Управление на знания",
    "group": "ОКН",
    "teacher": "Л. Зографова",
    "type": "сем група 4",
    "day": "Четвъртък",
    "from": 18,
    "to": 20,
    "room": "ФМИ-01"
}, {
    "name": "Алгебра 2",
    "group": "Математика",
    "teacher": "гл.ас. Д. Радкова, гл.ас. Н. Колев, ас. К. Табаков",
    "type": "лек",
    "day": "Сряда",
    "from": 13,
    "to": 16,
    "room": "ФМИ-01"
}, {
    "name": "Екстремални задачи за полиноми",
    "group": "Математика",
    "teacher": "проф. Г. Николов",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 12,
    "room": "ФМИ-310"
}, {
    "name": "Изомонодромна деформация на линейни ОДУ с коефициенти рационални функции",
    "group": "Математика",
    "teacher": "гл.ас. Ц. Стоянова",
    "type": "лек",
    "day": "Петък",
    "from": 14,
    "to": 17,
    "room": "ФМИ-405"
}, {
    "name": "Комплексен анализ",
    "group": "Математика",
    "teacher": "проф. Е. Христов",
    "type": "лек",
    "day": "Сряда",
    "from": 12,
    "to": 14,
    "room": "ФМИ-514"
}, {
    "name": "Комплексен анализ",
    "group": "Математика",
    "teacher": "проф. Е. Христов",
    "type": "сем",
    "day": "Четвъртък",
    "from": 12,
    "to": 14,
    "room": "ФМИ-303"
}, {
    "name": "Коректно поставени задачи за еволюционни у-ния и системи",
    "group": "Математика",
    "teacher": "проф. Н. Попиванов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 16,
    "to": 19,
    "room": "ФМИ-210"
}, {
    "name": "Логическо програмиране",
    "group": "Математика",
    "teacher": "проф. Т. Тинчев",
    "type": "лек",
    "day": "Петък",
    "from": 12,
    "to": 15,
    "room": "ФМИ-200"
}, {
    "name": "Логическо програмиране",
    "group": "Математика",
    "teacher": "гл.ас. А. Зиновиев",
    "type": "сем",
    "day": "Вторник",
    "from": 11,
    "to": 13,
    "room": "ФМИ-405"
}, {
    "name": "Математическа логика",
    "group": "Математика",
    "teacher": "проф. Д. Вакарелов",
    "type": "лек",
    "day": "Петък",
    "from": 16,
    "to": 20,
    "room": "ФМИ-02"
}, {
    "name": "Небесна механика",
    "group": "Математика",
    "teacher": "доц. А.Живков",
    "type": "лек",
    "day": "Петък",
    "from": 9,
    "to": 12,
    "room": "ФМИ-101"
}, {
    "name": "Нелинеен функционален анализ",
    "group": "Математика",
    "teacher": "доц. Н. Рибарска",
    "type": "лек",
    "day": "Сряда",
    "from": 17,
    "to": 20,
    "room": "ФМИ-304"
}, {
    "name": "Приложение на групите на Ли в диференциалните уравнения",
    "group": "Математика",
    "teacher": "гл.ас. Б. Георгиева",
    "type": "лек",
    "day": "Вторник",
    "from": 13,
    "to": 16,
    "room": "ФЗФ-13А"
}, {
    "name": "Риманова геометрия, избрани приложения, метод на\nБохнер и теореми за анулиране",
    "group": "Математика",
    "teacher": "проф. С. Иванов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 9,
    "to": 13,
    "room": "ФМИ-302"
}, {
    "name": "Соболеви пространства и приложения в ЧДУ визуализация",
    "group": "Математика",
    "teacher": "проф. Н. Попиванов",
    "type": "лек",
    "day": "Вторник",
    "from": 16,
    "to": 19,
    "room": "ФМИ-Център по"
}, {
    "name": "Състезания по математика за студенти - 2 част",
    "group": "Математика",
    "teacher": "доц. Вл. Бабев",
    "type": "лек",
    "day": "Четвъртък",
    "from": 15,
    "to": 18,
    "room": "ФМИ-526"
}, {
    "name": "Теория на Галоа",
    "group": "Математика",
    "teacher": "доц. П. Сидеров",
    "type": "лек",
    "day": "Понеделник",
    "from": 9,
    "to": 12,
    "room": "ФМИ-210"
}, {
    "name": "Топология за информатици",
    "group": "Математика",
    "teacher": "проф. Г. Димов",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 14,
    "to": 18,
    "room": "ФМИ-307"
}, {
    "name": "Увод в съвременната теория на ЧДУ",
    "group": "Математика",
    "teacher": "доц. Г. Дачев",
    "type": "лек",
    "day": "Сряда",
    "from": 11,
    "to": 14,
    "room": "ФМИ-304"
}, {
    "name": "Функционален анализ",
    "group": "Математика",
    "teacher": "доц. Н. Рибарска",
    "type": "лек",
    "day": "Сряда",
    "from": 18,
    "to": 21,
    "room": "ФМИ-310"
}, {
    "name": "Функционални пространства и теория на интерполацията",
    "group": "Математика",
    "teacher": "проф. Л. Николова",
    "type": "лек",
    "day": "Петък",
    "from": 12,
    "to": 15,
    "room": "ФМИ-404"
}, {
    "name": "Хамилтонови системи",
    "group": "Математика",
    "teacher": "проф. Е. Хорозов",
    "type": "лек",
    "day": "Четвъртък",
    "from": 15,
    "to": 18,
    "room": "ФМИ-304"
}, {
    "name": "Числа на Ремзи",
    "group": "Математика",
    "teacher": "проф. Н. Хаджииванов",
    "type": "лек",
    "day": "Петък",
    "from": 13,
    "to": 16,
    "room": "ФМИ-326"
}, {
    "name": "Числено интегриране",
    "group": "Математика",
    "teacher": "проф. Г. Николов",
    "type": "лек",
    "day": "Сряда",
    "from": 16,
    "to": 19,
    "room": "ФМИ-404"
}, {
    "name": "Едночипови микрокомпютри (практикум)",
    "group": "Комп. практикум",
    "teacher": "доц. А. Петков, Ат. Бъчваров",
    "type": "сем",
    "day": "Четвъртък",
    "from": 15,
    "to": 17,
    "room": "ФМИ-02"
}, {
    "name": "Едночипови микрокомпютри (практикум)",
    "group": "Комп. практикум",
    "teacher": "доц. А. Петков,",
    "type": "лаб",
    "day": "Четвъртък",
    "from": 17,
    "to": 19,
    "room": "ФМИ-321к"
}, {
    "name": "Математическа текстообработка",
    "group": "Комп. практикум",
    "teacher": "гл.ас. В. Черногоров",
    "type": "лаб",
    "day": "Петък",
    "from": 10,
    "to": 14,
    "room": "ФМИ-306к"
}, {
    "name": "Мултимедийни технологии",
    "group": "Комп. практикум",
    "teacher": "гл.ас. Тр. Илиев",
    "type": "лек+лаб",
    "day": "Петък",
    "from": 14,
    "to": 18,
    "room": "ФМИ-122к"
}, {
    "name": "Числени методи за ДУ практикум",
    "group": "Комп. практикум",
    "teacher": "ас. В. Ракидзи",
    "type": "лаб",
    "day": "Сряда",
    "from": 9,
    "to": 12,
    "room": "ФМИ-314к"
}, {
    "name": "Администриране на SQL сървър за БД",
    "group": "ЯКН",
    "teacher": "Н. Чобанов",
    "type": "лек+лаб",
    "day": "Сряда",
    "from": 18,
    "to": 22,
    "room": "ФМИ-120к"
}, {
    "name": "Архитектурно моделиране и симулация на информационни системи",
    "group": "ЯКН",
    "teacher": "доц. А. Семерджиев",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 12,
    "to": 16,
    "room": "ФХФ-210"
}, {
    "name": "Бази от данни",
    "group": "ЯКН",
    "teacher": "гл.ас. М. Филипова",
    "type": "лек",
    "day": "Вторник",
    "from": 14,
    "to": 16,
    "room": "ФМИ-326"
}, {
    "name": "Бази от данни",
    "group": "ЯКН",
    "teacher": "С. Илков",
    "type": "сем",
    "day": "Четвъртък",
    "from": 16,
    "to": 18,
    "room": "ФМИ-320к"
}, {
    "name": "Географски информационни системи",
    "group": "ЯКН",
    "teacher": "доц. Е. Кръстев, Пл. Иванов(х)",
    "type": "лек+лаб",
    "day": "Понеделник",
    "from": 17,
    "to": 21,
    "room": "ФМИ-306к"
}, {
    "name": "Директорийни услуги",
    "group": "ЯКН",
    "teacher": "гл.ас . Г. Георгиев",
    "type": "лек+лаб",
    "day": "Вторник",
    "from": 18,
    "to": 22,
    "room": "ФМИ-120к"
}, {
    "name": "Електронно обучение",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев",
    "type": "лек",
    "day": "Вторник",
    "from": 15,
    "to": 17,
    "room": "ФМИ-02"
}, {
    "name": "Електронно обучение",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малчева",
    "type": "лаб",
    "day": "Сряда (група 1)",
    "from": 9,
    "to": 11,
    "room": "ФМИ-019к"
}, {
    "name": "Електронно обучение",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малчева",
    "type": "лаб",
    "day": "Сряда (група 2)",
    "from": 11,
    "to": 13,
    "room": "ФМИ-019к"
}, {
    "name": "Електронно обучение",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев",
    "type": "лаб",
    "day": "Четвъртък (група 3)",
    "from": 8,
    "to": 10,
    "room": "ФМИ-122к"
}, {
    "name": "Електронно обучение",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев",
    "type": "лаб",
    "day": "Четвъртък (група 4)",
    "from": 10,
    "to": 12,
    "room": "ФМИ-122к"
}, {
    "name": "Конкурентно програмиране",
    "group": "ЯКН",
    "teacher": "гл.ас. Р. Лесева",
    "type": "лек",
    "day": "Сряда",
    "from": 15,
    "to": 18,
    "room": "ФМИ-306к"
}, {
    "name": "Многоагентни системи и социална роботика",
    "group": "ЯКН",
    "teacher": "гл.ас. Тр. Илиев",
    "type": "лек+лаб",
    "day": "Сряда",
    "from": 8,
    "to": 12,
    "room": "ФМИ-122к"
}, {
    "name": "Мобилно интернет съдържание",
    "group": "ЯКН",
    "teacher": "проф. В. Георгиев",
    "type": "лек+лаб",
    "day": "Вторник група 1",
    "from": 17,
    "to": 21,
    "room": "ФМИ-107к"
}, {
    "name": "Мобилно интернет съдържание",
    "group": "ЯКН",
    "teacher": "проф. В. Георгиев",
    "type": "лек+лаб",
    "day": "Вторник (група 2)",
    "from": 17,
    "to": 21,
    "room": "ФМИ-122к"
}, {
    "name": "Мрежово програмиране с Java",
    "group": "ЯКН",
    "teacher": "доц. М. Петров",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 17,
    "to": 21,
    "room": "ФМИ-309к"
}, {
    "name": "Основи на компютърните мрежи",
    "group": "ЯКН",
    "teacher": "проф. Кр. Стефанов",
    "type": "лек",
    "day": "Понеделник",
    "from": 12,
    "to": 13,
    "room": "ФМИ-120к"
}, {
    "name": "Основи на компютърните мрежи",
    "group": "ЯКН",
    "teacher": "ас. К. Тодорова",
    "type": "лаб",
    "day": "Понеделник",
    "from": 13,
    "to": 17,
    "room": "ФМИ-120к"
}, {
    "name": "Основи на компютърните мрежи",
    "group": "ЯКН",
    "teacher": "ас. З. Якова",
    "type": "лаб",
    "day": "Сряда",
    "from": 10,
    "to": 14,
    "room": "ФМИ-014к"
}, {
    "name": "Практическо програмиране с Perl",
    "group": "ЯКН",
    "teacher": "ас. Г. Пенков",
    "type": "лек+сем+лаб",
    "day": "Петък",
    "from": 16,
    "to": 20,
    "room": "ФМИ-107к"
}, {
    "name": "Практическо програмиране с Perl",
    "group": "ЯКН",
    "teacher": "ас. Г. Пенков",
    "type": "лек+сем+лаб",
    "day": "Вторник",
    "from": 19,
    "to": 21,
    "room": "ФМИ-320к"
}, {
    "name": "Програмиране с Python",
    "group": "ЯКН",
    "teacher": "Н. Бачийски",
    "type": "лаб",
    "day": "Понеделник",
    "from": 19,
    "to": 21,
    "room": "ФМИ-200"
}, {
    "name": "Програмиране с Python",
    "group": "ЯКН",
    "teacher": "Н. Бачийски",
    "type": "лаб",
    "day": "Сряда",
    "from": 19,
    "to": 21,
    "room": "ФМИ-200"
}, {
    "name": "Проектиране на човеко-машинен интерфейс",
    "group": "ЯКН",
    "teacher": "проф. Кр. Стефанов",
    "type": "лек",
    "day": "Петък",
    "from": 9,
    "to": 11,
    "room": "ФМИ-325"
}, {
    "name": "Проектиране на човеко-машинен интерфейс",
    "group": "ЯКН",
    "teacher": "ас. А. Георгиев, Е. Пелтекова",
    "type": "лаб",
    "day": "Четвъртък група 1",
    "from": 16,
    "to": 18,
    "room": "ФМИ-122к"
}, {
    "name": "Проектиране на човеко-машинен интерфейс",
    "group": "ЯКН",
    "teacher": "ас. А. Георгиев, Е. Пелтекова",
    "type": "лаб",
    "day": "Четвъртък (група 2)",
    "from": 14,
    "to": 16,
    "room": "ФМИ-122к"
}, {
    "name": "Проектиране, разработка и оценка на образ. софтуер",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малчева",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 11,
    "room": "ФМИ-019к"
}, {
    "name": "Проектиране, разработка и оценка на образ. софтуер",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев, ас. Т. Зафирова-Малчева,",
    "type": "лаб",
    "day": "Вторник група 1",
    "from": 11,
    "to": 13,
    "room": "ФМИ-014к"
}, {
    "name": "Проектиране, разработка и оценка на образ. софтуер",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев, ас. Т. Зафирова-Малчева,",
    "type": "лаб",
    "day": "Вторник (група 2)",
    "from": 11,
    "to": 13,
    "room": "ФМИ-019к"
}, {
    "name": "Разработване на ИКТ - базирано обучение",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев",
    "type": "лек",
    "day": "Вторник",
    "from": 17,
    "to": 19,
    "room": "ФМИ-02"
}, {
    "name": "Разработване на ИКТ - базирано обучение",
    "group": "ЯКН",
    "teacher": "ас. П. Михнев",
    "type": "лаб",
    "day": "Вторник",
    "from": 9,
    "to": 11,
    "room": "ФМИ-122к"
}, {
    "name": "Разработка на бизнес приложения със средствата на Java Enterprise Edition (Java EE)",
    "group": "ЯКН",
    "teacher": "доц. М. Тодорова, Б. Цветков, Е. Симеонов",
    "type": "лек",
    "day": "Вторник",
    "from": 18,
    "to": 22,
    "room": "ФМИ-200"
}, {
    "name": "Разработка на бизнес приложения със средствата на Java Enterprise Edition (Java EE)",
    "group": "ЯКН",
    "teacher": "доц. М. Тодорова, Б. Цветков, Е. Симеонов",
    "type": "лек",
    "day": "Събота",
    "from": 9,
    "to": 12,
    "room": "ФМИ-309к"
}, {
    "name": "С++ за напреднали",
    "group": "ЯКН",
    "teacher": "инф. Д. Трендафилов",
    "type": "сем",
    "day": "Петък",
    "from": 16,
    "to": 19,
    "room": "ФМИ-01"
}, {
    "name": "Съвременно функционално програмиране",
    "group": "ЯКН",
    "teacher": "н.с. Б. Банчев",
    "type": "лек",
    "day": "Петък",
    "from": 17,
    "to": 19,
    "room": "ФМИ-326"
}, {
    "name": "Съвременно функционално програмиране",
    "group": "ЯКН",
    "teacher": "н.с. Б. Банчев",
    "type": "сем",
    "day": "Петък",
    "from": 19,
    "to": 21,
    "room": "ФМИ-321к"
}, {
    "name": "Увод в информационната сигурност",
    "group": "ЯКН",
    "teacher": "доц. Д. Биров",
    "type": "лек",
    "day": "Вторник",
    "from": 16,
    "to": 18,
    "room": "ФМИ-325"
}, {
    "name": "Управление на паметта",
    "group": "ЯКН",
    "teacher": "доц. А. Семерджиев",
    "type": "лек+сем",
    "day": "Вторник",
    "from": 16,
    "to": 20,
    "room": "ФХФ-210"
}, {
    "name": "Цифров дизайн и мултимедия - графичен дизайн",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малче",
    "type": "лек",
    "day": "Вторник",
    "from": 13,
    "to": 15,
    "room": "ФМИ-514"
}, {
    "name": "Цифров дизайн и мултимедия - графичен дизайн",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малче",
    "type": "лаб",
    "day": "Четвъртък",
    "from": 9,
    "to": 11,
    "room": "ФМИ-019к"
}, {
    "name": "Цифров дизайн и мултимедия - цифрови медии",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малче",
    "type": "лек",
    "day": "Сряда",
    "from": 15,
    "to": 17,
    "room": "ФМИ-326"
}, {
    "name": "Цифров дизайн и мултимедия - цифрови медии",
    "group": "ЯКН",
    "teacher": "ас. Т. Зафирова-Малче",
    "type": "лаб",
    "day": "Четвъртък",
    "from": 11,
    "to": 13,
    "room": "ФМИ-019к"
}, {
    "name": "Visual basic за приложения",
    "group": "Информатика",
    "teacher": "доц. А. Ангелов, гл.ас. Р. Исуфов",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 9,
    "to": 13,
    "room": "ФМИ-403"
}, {
    "name": "Въведение в генетиката",
    "group": "Хуманитарни",
    "teacher": "проф. д-р Г. Генова",
    "type": "лек",
    "day": "Четвъртък",
    "from": 16,
    "to": 18,
    "room": "ФМИ-313k"
}, {
    "name": "Въведение в генетиката",
    "group": "Хуманитарни",
    "teacher": "доц. Е. Молле",
    "type": "лаб",
    "day": "Четвъртък",
    "from": 14,
    "to": 16,
    "room": "ФМИ-313k"
}, {
    "name": "Езикова култура",
    "group": "Хуманитарни",
    "teacher": "доц. П. Осенова, ас. Л. Ласкова",
    "type": "лек+сем",
    "day": "Петък",
    "from": 9,
    "to": 12,
    "room": "ФМИ-01"
}, {
    "name": "Невербална комуникация в публичната реч и деловото общуване",
    "group": "Хуманитарни",
    "teacher": "гл.ас. Г. Петрински",
    "type": "лек+сем",
    "day": "Понеделник",
    "from": 17,
    "to": 21,
    "room": "ФМИ-229"
}, {
    "name": "Реторика и комуникативни умения",
    "group": "Хуманитарни",
    "teacher": "гл.ас. д-р Г. Петрински",
    "type": "лек+сем",
    "day": "Вторник",
    "from": 17,
    "to": 19,
    "room": "ФМИ-326"
}, {
    "name": "Реторика и комуникативни умения",
    "group": "Хуманитарни",
    "teacher": "гл.ас. д-р Г. Петрински",
    "type": "лек+сем",
    "day": "Сряда",
    "from": 17,
    "to": 19,
    "room": "ФМИ-326"
}, {
    "name": "Руски език за начинаещи",
    "group": "Хуманитарни",
    "teacher": "доц. В. Занглигер",
    "type": "сем",
    "day": "Петък",
    "from": 12,
    "to": 14,
    "room": "ФМИ-304"
}, {
    "name": "Убеждаваща комуникация и диалог",
    "group": "Хуманитарни",
    "teacher": "доц. д-р В. Радева",
    "type": "лек",
    "day": "Четвъртък",
    "from": 17,
    "to": 19,
    "room": "ФМИ-02"
}, {
    "name": "Динамични геометрични системи",
    "group": "Дидактика",
    "teacher": "гл.асист. Т.Витанов",
    "type": "лек+сем",
    "day": "Петък",
    "from": 9,
    "to": 13,
    "room": "ФМИ-403"
}, {
    "name": "Динамични геометрични системи",
    "group": "Дидактика",
    "teacher": "гл.асист. Т.Витанов",
    "type": "лек",
    "day": "Сряда",
    "from": 9,
    "to": 11,
    "room": "ФМИ-305"
}, {
    "name": "Динамични геометрични системи",
    "group": "Дидактика",
    "teacher": "гл.асист. Т.Витанов",
    "type": "сем",
    "day": "Четвъртък",
    "from": 9,
    "to": 11,
    "room": "ФМИ-304"
}, {
    "name": "Компютърна евристика",
    "group": "Дидактика",
    "teacher": "доц. Т. Тонова",
    "type": "лаб",
    "day": "Четвъртък",
    "from": 11,
    "to": 13,
    "room": "ФМИ-309к"
}, {
    "name": "Математически методи в педагогическата диагностика",
    "group": "Дидактика",
    "teacher": "доц. К.Банков",
    "type": "лек+сем",
    "day": "Петък",
    "from": 13,
    "to": 17,
    "room": "ФМИ-120k"
}, {
    "name": "Неравенства",
    "group": "Дидактика",
    "teacher": "гл.асист. Д.Раковска",
    "type": "лек+сем",
    "day": "Четвъртък",
    "from": 9,
    "to": 13,
    "room": "ФМИ-311"
}, {
    "name": "Педагогически функции на интерактивна бяла дъска",
    "group": "Дидактика",
    "teacher": "доц.Е.Стефанова, гл.ас. Н. Николова",
    "type": "лек+сем - интензивно",
    "day": "07.03, 08.03, 14.03, 15.03, 21.03, 22.03 2015г.",
    "from": 9,
    "to": 19,
    "room": "ФМИ-018к"
}, {
    "name": "Познавателни процеси в математиката",
    "group": "Дидактика",
    "teacher": "доц. Т. Тонова",
    "type": "лек +сем",
    "day": "Сряда",
    "from": 14,
    "to": 18,
    "room": "ФМИ-302"
}, {
    "name": "Съвременни образователни технологии",
    "group": "Дидактика",
    "teacher": "доц. Т. Тонова, гл.ас. Н. Николова",
    "type": "лек+сем",
    "day": "Понеделник",
    "from": 9,
    "to": 13,
    "room": "ФМИ-303"
}, {
    "name": "Съдържание и методика на извънкласната работа по математика - Занятията започват от 01.04.2014г",
    "group": "Дидактика",
    "teacher": "доц. И. Тонов, доц. Т. Тонова",
    "type": "лек+сем",
    "day": "Петък",
    "from": 14,
    "to": 18,
    "room": "ФМИ-304"
}, {
    "name": "Технологиите в помощ на образователните проекти",
    "group": "Дидактика",
    "teacher": "доц.Е.Стефанова, гл.ас. Н. Николова",
    "type": "лек+сем - интензивно",
    "day": "30.05, 31.05, 06.06, 07.06, 13.06, 14.06 2015г.",
    "from": 9,
    "to": 19,
    "room": "ФМИ-122к"
}, {
    "name": "Учебна документация - Занятията започват от 01.04.2015г.",
    "group": "Дидактика",
    "teacher": "доц. Ю. Нинова",
    "type": "лек",
    "day": "Вторник",
    "from": 9,
    "to": 11,
    "room": "ФМИ-514"
}, {
    "name": "Учебна документация - Занятията започват от 01.04.2015г.",
    "group": "Дидактика",
    "teacher": "гл.асист. Д. Раковска, гл.ас. И. Вутова",
    "type": "сем",
    "day": "Вторник",
    "from": 11,
    "to": 15,
    "room": "ФМИ-305"
}];